In [1]:
#import libraries
import pandas as pd
import sqlite3 as db

In [2]:
conn = db.connect('sqlite.db')

In [3]:
cn = conn.cursor()

In [ ]:
#DROP TABLE table_name;
cn.execute("DROP TABLE employees")

In [ ]:
cn.execute("CREATE TABLE employees (empid INTEGER PRIMARY KEY, firstname NVARCHAR(50), lastname NVARCHAR(50))")

In [4]:
cn.execute("SELECT name FROM sqlite_master WHERE type='table';")
print(cn.fetchall())

[('employees',)]

In [ ]:
cn.execute("INSERT INTO employees VALUES (1,'John','Doe')")
cn.execute("INSERT INTO employees VALUES (2,'Jason','Hale')")
cn.execute("INSERT INTO employees VALUES (3,'Sam','Billing')")

In [5]:
cn.execute("SELECT * FROM employees;")
print(cn.fetchall())

[(0, 1, 'John', 'Doe'), (1, 2, 'Jason', 'Hale'), (2, 3, 'Sam', 'Billing'), (3, 4, 'Gustavo', 'Achong'), (4, 5, 'Kim', 'Abercrombie'), (5, 6, 'Pilar', 'Bernard'), (6, 7, 'Frances', 'Adams'), (7, 8, 'Margaret', 'Smith'), (8, 9, 'Angela', 'Adams')]

In [ ]:
new_employees = [(4, 'Gustavo', 'Achong'),
 (5, 'Kim', 'Abercrombie'),
 (6, 'Pilar', 'Bernard'),
 (7, 'Frances', 'Adams'),
 (8, 'Margaret', 'Smith'),
 (9, 'Angela', 'Adams'),
 (10, 'Samuel', 'Agcaoili')]
cn.executemany('INSERT INTO employees VALUES (?, ?, ?)', new_employees)

In [6]:
cn.execute("SELECT * FROM employees;")
print(cn.fetchall())

[(0, 1, 'John', 'Doe'), (1, 2, 'Jason', 'Hale'), (2, 3, 'Sam', 'Billing'), (3, 4, 'Gustavo', 'Achong'), (4, 5, 'Kim', 'Abercrombie'), (5, 6, 'Pilar', 'Bernard'), (6, 7, 'Frances', 'Adams'), (7, 8, 'Margaret', 'Smith'), (8, 9, 'Angela', 'Adams')]

In [ ]:
conn.commit()

In [ ]:
cn.close()
conn.close()

In [7]:
con = db.connect('sqlite.db')
df_employees = pd.read_sql_query('select * from employees', con)

In [8]:
df_employees

   index  empid firstname     lastname
0      0      1      John          Doe
1      1      2     Jason         Hale
2      2      3       Sam      Billing
3      3      4   Gustavo       Achong
4      4      5       Kim  Abercrombie
5      5      6     Pilar      Bernard
6      6      7   Frances        Adams
7      7      8  Margaret        Smith
8      8      9    Angela        Adams

In [9]:
df_new = df_employees[:-1]

In [ ]:
df_new

In [ ]:
df_new.to_sql("employees", con, if_exists="replace")

In [ ]:
pd.read_sql_query ('select * from employees', con)

In [10]:
con.close()

In [ ]:
#end of notebook